/**
*******************************************************************************************************
*			 			 				shell 配置文件									 
*                      		(c) Copyright 2013-2020, xxx公司, 广州
*                              			All Rights Reserved
*  
* 
* @文件名	shell_config.h
* @作者  		 
* @版本 	V1.0
* @日期    	2017-09-06
* @说明   	配置shell功能等。
*******************************************************************************************************
* @注意事项
*
*******************************************************************************************************
* @修改记录
*
*******************************************************************************************************
*/


#define BOOT_VERSTION			20170920 				/* Revision ID 												*/	
#define CONFIG_SYS_LONGHELP 		1					/* 是否使用较为详细的帮助信息								*/
#define CONFIG_AUTO_COMPLETE 		0					/* 是否使用命令自动补全功能									*/
#define CONFIG_BOOTDELAY			10
  



#define IS_USE_LOADX_CMD			1					/* 是否使用xmodem协议进行串口文件传输						*/	
#define IS_USE_VERSION_CMD			1					/* 是否使用查看bootloader版本号								*/	
#define IS_USE_HELP_CMD				1					/* 是否使用xmodem协议进行串口文件传输						*/	
#define IS_USE_XMODEM_CMD			1					/* 是否使用xmodem协议进行串口文件传输						*/	
#define IS_USE_BOOT_CMD				1					/* 是否使用BOOT命令											*/	
