/**
*******************************************************************************************************
*			 			 					xmdoem协议底层驱动封装								 
*                      		(c) Copyright 2013-2020, xxx公司, 广州
*                              			All Rights Reserved
*  
* 
* @文件名	Xmodem_io.h
* @作者  		 
* @版本 	V1.0
* @日期    	2017-09-06
* @说明   	xmodem协议底层输入输出
*******************************************************************************************************
* @注意事项
*
*******************************************************************************************************
* @修改记录
*
*******************************************************************************************************
*/
 #ifndef __XMODEM_IO_H
#define __XMODEM_IO_H





void Xmodem_BspInit(void);
void Xmodem_SendOneByte(unsigned char OneByte);
unsigned char Xmodem_RecieveByte(unsigned char * RecByte);
void Xmodem_ClearRecieveCache(void);


#endif
