/**
*******************************************************************************************************
*			 			 				命令终端shell-帮助信息命令								 
*                      			(c) Copyright 2013-2020, xxx公司, 广州
*                              			All Rights Reserved
*  
* 
* @文件名	cmd_help.c
* @作者  		 
* @版本 	V1.0
* @日期    	2017-09-06
* @说明   	帮助信息提示
*******************************************************************************************************
* @注意事项
*
*******************************************************************************************************
* @修改记录
*
*******************************************************************************************************
*/
/* Includes -----------------------------------------------------------------------------------------*/
#include "cmd_help.h"
#include "stdio.h"
#include "string.h"

/*
*********************************************************************************************************
*                                        帮助信息提示命令
*
* 描述  : 无
*
* 参数  : cmd_tbl_t			指向该命令的命令表信息
*
* 返回值: 无
*
* 备注  : 无
*********************************************************************************************************
*/
int do_help (cmd_tbl_t * a, int b, int c , char* d[])
{
	switch((unsigned int)d[0]) 				/* 根据参数个数进行处理										*/
	{
		case 0:								/* 参数为1个，则显示命令终端支持的命令						*/
			while(a->cmd != 0)	 	
			{
				printf("\n\r\t%s\t- %s\r\n",a->name, a->help);
				a++;
			}
			break;
		case 1:								/* 参数为2个，则显示具体命令的用法							*/
			while(a->cmd != 0 && strcasecmp(a->name, d[2]) !=0)
				a++;
			if(a->cmd != 0)
				printf("Usage:\t%s\r\n", a->usage);
			else
				printf("\tcan't find the command.\r\n");
			break;

	}
	return 1;
}



